Repository: aswiro/tmb
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# admin-welcome-message
source: 👋 Welcome to the admin panel, {user_name}! You have extended rights to manage the bot and groups.
ru: 👋 Добро пожаловать в панель администратора, {user_name}! Вы имеете расширенные права для управления ботом и группами.

# captcha-settings-menu
source: Captcha Settings
ru: Настройки каптчи

source: enter-new-value
ru: Введите новое значение

# invalid-numeric-value
source: ❌ Invalid value. Please enter a valid number.
ru: ❌ Неверное значение. Пожалуйста, введите корректное число.

# select_group
source: 📋 Select a group to configure filters:
ru: 📋 Выберите группу для настройки фильтров:

# no-filters-found
source: ❌ No filters found for this group.
ru: ❌ Фильтры для этой группы не найдены.

source: Unknown group
ru: Неизвестная группа

# filters-for-group
source: 🔧 Filters for group: {group_name}
ru: 🔧 Фильтры для группы: {group_name}

# filter-updated-success
source: ✅ Filter successfully updated for group: {group_name}
ru: ✅ Фильтр успешно обновлен для группы: {group_name}

# filter-max-message-length
source: Max message length
ru: Макс. длина сообщения

# filter-bonus-per-user
source: Bonus per user
ru: Бонус за пользователя

# filter-bonus-checkpoint
source: Bonus checkpoint
ru: Контрольная точка бонуса

# enter-value
source: Enter new value for filter {filter_name}. Current value: {current_value}
ru: Введите новое значение для фильтра {filter_name}. Текущее значение: {current_value}

# invalid-message-length-range
source: ❌ Invalid value! Message length must be between 10 and 4000 characters.
ru: ❌ Недопустимое значение! Длина сообщения должна быть от 10 до 4000 символов.

# invalid-bonus-per-user-range
source: ❌ Invalid value! Bonus per user must be between 1 and 100 units.
ru: ❌ Недопустимое значение! Бонус за пользователя должен быть от 1 до 100 единиц.

# invalid-bonus-checkpoint-range
source: ❌ Invalid value! Bonus checkpoint must be between 100 and 10000 units.
ru: ❌ Недопустимое значение! Контрольная точка бонуса должна быть от 100 до 10000 единиц.

# filter-update-error
source: ❌ Error updating filter. Please try again.
ru: ❌ Ошибка при обновлении фильтра. Попробуйте еще раз.

# error-getting-groups
source: ❌ Error getting groups list.
ru: ❌ Ошибка получения списка групп.

# groups-list-empty
source: 📭 Groups list is empty.
ru: 📭 Список групп пуст.

# all-groups-header
source: 📋 All groups:
ru: 📋 Все группы:

# add-group-instructions
source: Please send me the group link or username (e.g., @groupname or https://t.me/groupname)
ru: Пожалуйста, отправьте мне ссылку на группу или имя пользователя (например, @groupname или https://t.me/groupname)

# invalid-group-format
source: ❌ Invalid group format. Please send a valid group link or username.
ru: ❌ Неверный формат группы. Пожалуйста, отправьте действительную ссылку на группу или имя пользователя.

# getting-group-info
source: 🔍 Getting group information...
ru: 🔍 Получение информации о группе...

# getting-admins-list
source: 👥 Getting administrators list...
ru: 👥 Получение списка администраторов...

source: 💾 Saving to database...
ru: 💾 Сохранение в базу данных...

source: No username
ru: Нет имени пользователя

# group-added-success
source: ✅ Group successfully added to monitoring!
ru: ✅ Группа успешно добавлена в мониторинг!

# error-chat-not-found
source: ❌ Chat not found. Please check the link or username.
ru: ❌ Чат не найден. Пожалуйста, проверьте ссылку или имя пользователя.

# error-bot-not-member
source: ❌ Bot is not a member of this group. Please add the bot to the group first.
ru: ❌ Бот не является участником этой группы. Пожалуйста, сначала добавьте бота в группу.

# error-insufficient-rights
source: ❌ Bot has insufficient rights in this group.
ru: ❌ У бота недостаточно прав в этой группе.

# error-adding-group
source: ❌ Error adding group. Please try again later.
ru: ❌ Ошибка добавления группы. Пожалуйста, попробуйте позже.

# error-group-not-found
source: ❌ Group not found.
ru: ❌ Группа не найдена.

# error-insufficient-permissions
source: ❌ Insufficient permissions.
ru: ❌ Недостаточно прав.

# error-cannot-remove-related-data
source: ❌ Cannot remove related data.
ru: ❌ Невозможно удалить связанные данные.

source: ❌ Error removing group.
ru: ❌ Ошибка удаления группы.

source: ❌ Group not found.
ru: ❌ Группа не найдена.

source: ❌ Failed to remove group.
ru: ❌ Не удалось удалить группу.

# group-removed-success
source: ✅ Group successfully removed!
ru: ✅ Группа успешно удалена!

# choose-language
source: 🌐 Choose your language:
ru: 🌐 Выберите ваш язык:

# language-changed
source: ✅ Language changed successfully!
ru: ✅ Язык успешно изменен!

# welcome-message
source: 👋 Welcome, {user_name}! I'm a bot for monitoring Telegram groups. Choose an action from the menu below:
ru: 👋 Добро пожаловать, {user_name}! Я бот для мониторинга Telegram-групп. Выберите действие из меню ниже:

source: 🔙 Back to Menu
ru: 🔙 Назад в меню

source: 🌐 Change Language
ru: 🌐 Изменить язык

source: ➕ Add Group
ru: ➕ Добавить группу

source: 👥 My Groups
ru: 👥 Мои группы

source: 🔧 Filters Menu
ru: 🔧 Меню фильтров

source: captcha-type
ru: Тип капчи

source: captcha-size
ru: Размер капчи

source: Captcha difficulty
ru: Сложность

source: Easy
ru: Легкий

source: Light
ru: Простой

source: Medium
ru: Средний

source: Hard
ru: Сложный

source: Expert
ru: Эксперт

source: Nightmare
ru: Кошмар

source: captcha-chars-mode
ru: Набор символов

# nums
source: Numbers
ru: Цифры

source: Hex
ru: Шестнадцатеричные

source: captcha-multicolor
ru: Разноцветная

source: captcha-margin
ru: Отступы

source: captcha-multiplication
ru: Умножение

source: captcha-timeout
ru: Время на решение

# captcha-max-attempts
source: Max attempts
ru: Макс. попыток

# captcha-auto-kick
source: Auto-kick
ru: Автокик при неудаче

source: preview-captcha
ru: Предпросмотр

source: back-to-filters
ru: 🔙 Назад к фильтрам

# captcha-type-standard
source: Standard
ru: Стандарт

# captcha-type-math
source: Math
ru: Математическая

source: Back
ru: Назад

# filter-hashtag
source: Hashtags
ru: Хештеги

# filter-url
source: URL links
ru: URL-ссылки

# filter-email
source: Email addresses
ru: Email-адреса

# filter-ads
source: Advertisements
ru: Реклама

# filter-phone-number
source: Phone numbers
ru: Номера телефонов

# filter-forbidden-words
source: Forbidden words
ru: Запрещенные слова

# filter-track-members
source: Track members
ru: Отслеживание участников

# filter-captcha
source: Captcha
ru: Капча

source: captcha-settings
ru: Настройки каптчи

# filter-bonuses-enabled
source: Bonus system
ru: Система бонусов

source: 🔙 Back to groups
ru: 🔙 Назад к группам

# ad-menu
source: Ad Settings
ru: Настройка рекламы

source: Advertiser not found
ru: ❌ Рекламодатель не найден. Пожалуйста, зарегистрируйтесь как рекламодатель.

source: 📊 Advertiser Menu
ru: 👋 Добро пожаловать, {company_name}! 💰 Баланс: {balance} руб. Выберите действие:

# no-campaigns
source: You don't have any campaigns yet.
ru: 📭 У вас пока нет рекламных кампаний, {company_name}. Создайте свою первую кампанию!

# my-campaigns-header
source: 📋 My Campaigns:
ru: 📊 Мои кампании ({company_name}):

# campaign-info
source: 📊 Campaign: {name} 💰 Budget: ${budget} 📈 Status: {status} 📅 Created: {created_at}
ru: {number}. {name} 📊 {status} | 💰 {spent}/{budget} руб. ({progress}%)

source: Campaign not found
ru: ❌ Кампания не найдена или у вас нет доступа к ней.

# campaign-details
source: 📊 Campaign Details 📝 Name: {name} 💰 Daily Budget: ${daily_budget} 💸 Spent: ${spent_amount} 📈 Status: {status} 📅 Start Date: {start_date} 📅 End Date: {end_date} 🕒 Created: {created_at}
ru: 📊 Детали кампании 📝 Название: {name} {status_emoji} Статус: {status} 💰 Бюджет: {budget} руб. 💸 Потрачено: {spent} руб. 💵 Остаток: {remaining} руб. 📅 Начало: {start_date} 📅 Окончание: {end_date} 📈 Статистика: 👁 Показы: {impressions} 👆 Клики: {clicks} 💰 CTR: {ctr}%

# create-campaign-enter-name
source: 📝 Enter campaign name:
ru: 📝 Создание новой кампании для {company_name} Введите название кампании (от 3 до 100 символов):

# campaign-name-too-short
source: ❌ Campaign name is too short. Minimum 3 characters.
ru: ❌ Название кампании слишком короткое. Минимум 3 символа.

# campaign-name-too-long
source: ❌ Campaign name is too long. Maximum 100 characters.
ru: ❌ Название кампании слишком длинное. Максимум 100 символов.

# create-campaign-enter-budget
source: 💰 Enter daily budget (in USD):
ru: 💰 Кампания: {name} Введите дневной бюджет кампании (в рублях): Пример: 1000 или 1500.50

source: ❌ Budget must be positive.
ru: ❌ Бюджет должен быть больше нуля.

# budget-too-large
source: ❌ Budget is too large. Maximum $10,000 per day.
ru: ❌ Бюджет слишком большой. Максимум 1,000,000 рублей.

# invalid-budget-format
source: ❌ Invalid budget format. Please enter a number.
ru: ❌ Неверный формат бюджета. Введите число (например: 1000 или 1500.50).

# create-campaign-enter-start-date
source: 📅 Choose start date:
ru: 📅 Бюджет: {budget} руб. Выберите дату начала кампании или введите в формате ДД.ММ.ГГГГ ЧЧ:ММ Пример: 25.12.2024 10:00

# start-date-in-past
source: ❌ Start date cannot be in the past.
ru: ❌ Дата начала не может быть в прошлом.

# invalid-date-format
source: ❌ Invalid date format. Use DD.MM.YYYY
ru: ❌ Неверный формат даты. Используйте формат ДД.ММ.ГГГГ ЧЧ:ММ Пример: 25.12.2024 10:00

# create-campaign-enter-end-date
source: 📅 Choose end date:
ru: 📅 Начало: {start_date} Выберите дату окончания кампании или введите в формате ДД.ММ.ГГГГ ЧЧ:ММ Пример: 31.12.2024 23:59

# end-date-before-start
source: ❌ End date cannot be before start date.
ru: ❌ Дата окончания должна быть позже даты начала.

# create-campaign-confirmation
source: ✅ Campaign Summary 📝 Name: {name} 💰 Daily Budget: ${budget} 📅 Start Date: {start_date} 📅 End Date: {end_date} Confirm creation?
ru: ✅ Подтверждение создания кампании 📝 Название: {name} 💰 Дневной бюджет: {budget} руб. 📅 Начало: {start_date} 📅 Окончание: {end_date} Все данные верны?

# campaign-created-success
source: ✅ Campaign '{name}' created successfully!
ru: 🎉 Кампания '{name}' успешно создана! 🆔 ID кампании: {campaign_id} 📊 Статус: Черновик Теперь вы можете настроить креативы и запустить кампанию.

# campaign-creation-error
source: ❌ Error creating campaign. Please try again.
ru: ❌ Ошибка при создании кампании. Попробуйте еще раз.

source: ❌ Campaign creation cancelled.
ru: ❌ Создание кампании отменено.

# status-draft
source: Draft
ru: Черновик

# status-active
source: Active
ru: Активна

# status-paused
source: Paused
ru: Приостановлена

# status-completed
source: Completed
ru: Завершена

# status-cancelled
source: Cancelled
ru: Отменена

source: 📋 My Campaigns
ru: 📊 Мои кампании

source: ➕ Create Campaign
ru: ➕ Создать кампанию

# ad-analytics
source: 📊 Analytics
ru: 📈 Аналитика

source: 🔙 Back to Ad Menu
ru: 🔙 Назад в меню рекламы

source: 📊 Campaign Analytics
ru: 📈 Аналитика кампаний

# show-more-campaigns
source: 📄 Show More
ru: 📋 Показать больше

# activate-campaign
source: ▶️ Activate
ru: ▶️ Активировать

# pause-campaign
source: ⏸️ Pause
ru: ⏸️ Приостановить

# resume-campaign
source: ▶️ Resume
ru: ▶️ Возобновить

# edit-campaign
source: ✏️ Edit
ru: ✏️ Редактировать

# campaign-creatives
source: 🎨 Creatives
ru: 🎨 Креативы

source: 🔙 Back to Campaigns
ru: 🔙 К кампаниям

source: ❌ Cancel
ru: ❌ Отменить

source: 🚀 Start Now
ru: 🚀 Начать сейчас

source: 📅 Start Later
ru: 📅 Выбрать дату

# end-one-week
source: 📅 +1 Week
ru: 📅 Через неделю

# end-one-month
source: 📅 +1 Month
ru: 📅 Через месяц

# end-custom
source: 📅 Custom Date
ru: 📅 Выбрать дату

# confirm-create
source: ✅ Confirm
ru: ✅ Создать кампанию

source: View campaign
ru: 👁 Посмотреть кампанию

source: 🔧 Admin Ad Menu
ru: 👨‍💼 Панель администратора рекламы Выберите действие:

source: 📋 All Campaigns
ru: 📊 Все кампании

source: 👥 Advertiser Management
ru: 👥 Управление рекламодателями

source: 📊 Ad Analytics (Admin)
ru: 📈 Аналитика рекламы

source: No pending creatives
ru: Нет креативов на модерации

source: Show more creatives
ru: Показать ещё креативы

source: Refresh queue
ru: Обновить очередь

source: 🔙 Back to admin menu
ru: Назад в админ меню

# all-campaigns-title
source: 📊 All Ad Campaigns
ru: 📊 Все рекламные кампании

# total-campaigns
source: Total campaigns: {count}
ru: Всего кампаний: {count}

# page-info
source: Page {current} of {total}
ru: Страница {current} из {total}

source: ❌ No campaigns found
ru: ❌ Кампании не найдены

# advertisers-management-title
source: 🏢 Advertiser Management
ru: 🏢 Управление рекламодателями

# total-advertisers
source: Total advertisers: {count}
ru: Всего рекламодателей: {count}

# advertisers-page-info
source: Page {current} of {total}
ru: Страница {current} из {total}

source: No advertisers found
ru: Рекламодатели не найдены

# advertiser_details
source: 📊 Advertiser: {name} 💰 Balance: {balance}₽ 📈 Total campaigns: {total_campaigns} 🟢 Active campaigns: {active_campaigns} 💸 Total spent: {total_spent}₽ 📅 Registration date: {created_at}
ru: 📊 Рекламодатель: {name} 💰 Баланс: {balance}₽ 📈 Всего кампаний: {total_campaigns} 🟢 Активных кампаний: {active_campaigns} 💸 Потрачено всего: {total_spent}₽ 📅 Дата регистрации: {created_at}

# edit_advertiser_balance
source: 💰 Edit Balance
ru: 💰 Изменить баланс

# view_advertiser_campaigns
source: 📈 Advertiser Campaigns
ru: 📈 Кампании рекламодателя

# block_advertiser
source: 🚫 Block
ru: 🚫 Заблокировать

source: ⬅️ Back to Advertisers
ru: ⬅️ К списку рекламодателей

source: ❌ Advertiser not found
ru: ❌ Рекламодатель не найден

# approve-creative
source: Approve
ru: Одобрить

# reject-creative
source: Reject
ru: Отклонить

source: Back to moderation
ru: Назад к модерации

source: Inappropriate content
ru: Неподходящий контент

# misleading-info
source: Misleading information
ru: Вводящая в заблуждение информация

source: Poor quality
ru: Низкое качество

source: Policy violation
ru: Нарушение политики

source: Custom reason
ru: Другая причина

source: Back to creative
ru: Назад к креативу

# moderation-queue-header
source: 📋 Creative Moderation Queue
ru: 📋 Очередь модерации креативов

# no-creatives-pending
source: No creatives pending moderation.
ru: В очереди модерации нет креативов.

# creative-details-header
source: 📝 Creative Details
ru: 📝 Детали креатива

# creative-type
source: Type: {type}
ru: Тип: {type}

# creative-campaign
source: Campaign: {campaign}
ru: Кампания: {campaign}

# creative-advertiser
source: Advertiser: {advertiser}
ru: Рекламодатель: {advertiser}

# creative-created
source: Created: {date}
ru: Создан: {date}

# creative-approved-success
source: ✅ Creative approved successfully!
ru: ✅ Креатив успешно одобрен!

# creative-rejected-success
source: ❌ Creative rejected. Reason: {reason}
ru: ❌ Креатив отклонён. Причина: {reason}

source: Creative not found.
ru: Креатив не найден.

# moderation-error
source: Error during creative moderation.
ru: Ошибка при модерации креатива.

source: Select rejection reason:
ru: Выберите причину отклонения:

# enter-custom-reason
source: Enter rejection reason:
ru: Введите причину отклонения:

# reason-inappropriate
source: Inappropriate content
ru: Неподходящий контент

# reason-misleading
source: Misleading information
ru: Вводящая в заблуждение информация

# reason-quality
source: Poor quality
ru: Низкое качество

# reason-policy
source: Policy violation
ru: Нарушение политики

source: 💰 My Balance
ru: 💰 Мой баланс

source: 🔍 Moderate Ads
ru: 🔍 Модерация рекламы

source: 📅 One Week
ru: 📅 Одна неделя

source: 📅 One Month
ru: 📅 Один месяц

# error-occurred
source: ❌ An error occurred
ru: ❌ Произошла ошибка
